#include <stdio.h>
int main() {
    int i = 1;                    // กำหนดค่าเริ่มต้น i = 1

    do {                          // ทำงานในบล็อกนี้อย่างน้อย 1 ครั้ง
        if (i == 6) {             // ถ้า i เท่ากับ 6
            i++;                  // เพิ่มค่า i ก่อน ไม่งั้นจะวนค้าง
            continue;             // ข้าม printf แล้วไปเช็กเงื่อนไข while
        }
        printf("%d ", i);         // แสดงค่าของ i
        i++;                      // เพิ่มค่า i ทีละ 1
    } while (i <= 10);            // ตรวจสอบเงื่อนไข ถ้า i <= 10 ทำต่อ
    return 0;                     // จบโปรแกรม
}